_posts/2015-08-26-installing-sled-12-with-pxe-using-libvirt.html
---
collections: post
layout: post
title: Installing SLED 12 with PXE using libvirt
date: 2015-08-26
categories: 
-
tags: 
- libvirt
- sled
- bridge
- stp
author: carltonf
excerpt: 
---
<p>
Recently I get a task to fix a bug related to SLED in KVM. Since there is a
local PXE server for easy installation, I've planned to install SLED in KVM
through PXE. Here is the struggle I've been through.
</p>

<p>
To get PXE installation work, I need to have a working bridge that will place VM
in the subnet with PXE server.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">With <code>NetworkManager</code></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>NetworkManager</code> is buggy. Despite the fact you can use a GUI to set up a
bridge, you'll encounter various issues that make your life hard: 
</p>

<ul class="org-ul">
<li>The status indicator in the dialog is incorrect

<p>
A bridge is always on regardless.
</p>
</li>

<li>Turning-off/Removal of an existing bridge is problematic.

<p>
Turning off doesn't seem to work. Remove a bridge in the dialog and yet this
bridge still exists.(verified using <code>nmcli con list</code> or <code>btrctl show</code>)
</p>
</li>
</ul>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Possible solution</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The following procedure can be used to create a <i>useful</i> bridge interface.
</p>

<p>
Refer to <a href="https://www.happyassassin.net/2014/07/23/bridged-networking-for-libvirt-with-networkmanager-2014-fedora-21/">this article</a> for detailed tips, basically:
</p>

<ul class="org-ul">
<li>Clean up existing profiles (as a safety measure).
</li>
<li>Use the GUI only to create a bridge, set up slave interface and etc, but <b>NOT</b>
  for anything else.
</li>
<li>Use <code>nmcli</code> to bring up the bridge.

<p>
<b>NOTE:</b> up until <code>0.9.8</code>, there is no feedback after <code>nmcli con up &lt;args&gt;</code> and
even with some feedback in later versions, it's something like "command sent
(DBus-activated successfully)". <code>DBus</code> remote call guarantees no timing, you
need to <b>wait</b> for a little while for things to settle down.
</p>
</li>
</ul>
</div>

<ul class="org-ul"><li><a id="sec-1-1-1" name="sec-1-1-1"></a>Remove a bridge connection<br  /><div class="outline-text-4" id="text-1-1-1">
<p>
As mentioned above this part is buggy:
</p>

<ul class="org-ul">
<li>Remove the bridge connection in the <code>NM</code> GUI interface.

<p>
Of course this does <span class="underline">NOT</span> really do anything, but if you don't do it the
bridge will persists even after you have removed it with rest steps, which is
just more confusing.
</p>
</li>

<li>Bring the bridge interface down.

<p>
Use <code>ip link set bridge0 down</code>, instead of <code>ifdown</code>, <code>btrctl</code> or <code>nmcli con</code>,
all of which will be obstructed by <code>NM</code>. I think <code>ip link</code> works at kernel
level directly.
</p>
</li>

<li>Remove the bridge.

<p>
<code>btrctl delbr bridge0</code> should pull the trick.
</p>
</li>
</ul>
</div>
</li></ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">The old good <code>CLI</code> approach.</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>systemctl disable network</code> to turn off the <code>NetworkManager</code>. All standard
procedures using <code>btrctl</code> should work.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Final tweak: STP.</h2>
<div class="outline-text-2" id="text-3">
<p>
The bridge interface created above will work <b>normally</b>, but might <b>NOT</b> with
<code>PXE</code>. The problem here is with the <code>STP</code>: <a href="https://en.wikipedia.org/wiki/Spanning_Tree_Protocol">Spanning Tree Protocol (wikipedia)</a>.
</p>

<p>
It's a protocol to avoid <a href="https://en.wikipedia.org/wiki/Switching_loop">Layer 2 switching loop</a>, (<a href="http://www.omnisecu.com/cisco-certified-network-associate-ccna/what-is-layer-2-switching-loop.php">another article with
illustration</a>) by creating a spanning tree in the network topology. In the
algorithm, there is a <code>blocking</code> phase to listen on the coming/going packets to
gather information before any packets are forwarded. This delay would result in
a timeout error in <code>PXE</code> connection.
</p>

<p>
It's not recommended to disable <code>STP</code>, but instead set <code>forward-delay</code> to 0 as
instructed in <a href="http://wiki.libvirt.org/page/PXE_boot_(or_dhcp)_on_guest_failed">libvirt's FAQ about bridge</a>. The <code>NetworkManager</code> approach creates
bridges with 15 seconds delay as default, and the <code>CLI</code> would create bridges
without <code>STP</code>.
</p>
</div>
</div>
